dist/maybe-monad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Maybe monad in Scheme</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"
                  href="./style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Maybe monad in Scheme</h1>
<p>
I recently watched this video from Computerphile <a href="https://www.youtube.com/watch?v=t1e8gqXLbsU&amp;pp=ygUPd2hhdCBpcyBhIG1vbmFk">What is a Monad?</a>, and since I'm trying to use more and more functional programming in my free-time, I thought it might be interesting to implement the simple <code>Maybe</code> monad from Haskell in Scheme (more specifically, Guile Scheme) because of it's simplicity, flexibility and power given by the <code>syntax-macro</code> special form.
</p>

<p>
To set things clear, the <code>Maybe</code> monad is in practice a special type that can be constructed in two ways:
</p>

<ul class="org-ul">
<li><code>Just x</code> which represents "just" (<i>aha</i>) the value <code>x</code></li>
<li><code>Nothing</code> which represents an error or something unexpected</li>
</ul>

<p>
In the video, Graham Hutton to justify the usage of <code>Maybe</code>, defines a function which performs an division between two integers, that returns <code>Nothing</code> if a number is divided by 0.
</p>

<p>
In the following, I'm going to stick to the examples made in the video. The goal will then be to build an <code>evaluator</code> function able to evaluate expressions of the form:
</p>

<ul class="org-ul">
<li><code>(val x)</code> where <code>x</code> is an integer value, that has to be evaluated as <code>x</code> itself</li>
<li><code>(div x y)</code> that has to be evaluated as <code>(quotient x y)</code></li>
</ul>

<p>
By using the <code>Maybe</code> monad, <code>evaluator</code> will automatically handle the possible error that comes from the division by 0.
</p>

<p>
<b>Please Note:</b> to perform pattern matching, I'm going to use the <code>(ice-9 match)</code> library which is provided by default in Guile Scheme.
</p>

<p>
Let's start by defining the basic expressions that can be evaluated:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span class="org-keyword">define</span> (<span class="org-function-name">val</span> expr) `(val ,expr)) <span class="org-comment-delimiter">;; </span><span class="org-comment">(val 1) =&gt; ('val 1)</span>
(<span class="org-keyword">define</span> (<span class="org-function-name">div</span> x y) `(div ,x ,y))  <span class="org-comment-delimiter">;; </span><span class="org-comment">(div 1 2) =&gt; ('div 1 2)</span>
</pre>
</div>

<p>
These helper functions build a list where the first element can be one of <code>val</code> or <code>div</code>, which enables easier pattern matching.
</p>

<p>
Now we can define how a <code>Maybe</code> is defined. To do this, a predicate <code>maybe?</code> comes handy to show explicitly what makes a <code>Maybe</code> exactly:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span class="org-keyword">define</span> (<span class="org-function-name">maybe?</span> x)
  (<span class="org-keyword">match</span> x
    (('just _) #t)
    ('nothing #t)
    (_ #f)))
</pre>
</div>

<p>
Great, so this enforces that a <code>Maybe</code> can be represented only by a pair <code>('just x)</code> or the symbol <code>'nothing</code>. Mind that <code>maybe?</code> is not strictly necessary, but makes things clearer.
We need now a way to construct cleanly a <code>Just</code> and a <code>Nothing</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span class="org-keyword">define</span> (<span class="org-function-name">just</span> x) `(just ,x))
(<span class="org-keyword">define</span> <span class="org-function-name">nothing</span> 'nothing)
</pre>
</div>

<p>
At this point, a <code>safediv</code> function that performs the integer division safely can be defined simply as:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span class="org-keyword">define</span> (<span class="org-function-name">safediv</span> x y)
  (<span class="org-keyword">if</span> (= y 0)
      nothing
      (just (quotient x y))))
</pre>
</div>

<p>
Is it all about the <code>Maybe</code> monad? Not really, there still is a missing piece. A monad requires two operations on it to be defined, which are <code>return</code> and <code>&gt;&gt;=</code> (wiew the second one as a kind of "pipe" between monads). The operations need to respect three laws (written in Scheme notation):
</p>

<ol class="org-ol">
<li><code>(&gt;&gt;= (return x) f)</code> should be equivalent to <code>(f x)</code>, where <code>f</code> is a function</li>
<li><code>(&gt;&gt;= m return)</code> should be equivalent to <code>m</code>, where <code>m</code> is a monad</li>
<li><code>(&gt;&gt;= (&gt;&gt;= m f) g)</code> should be equivalent to <code>(&gt;&gt;= m (lambda (x) (&gt;&gt;= (f x) g)))</code></li>
</ol>

<p>
The first law states that <code>return</code> is a left-identity w.r.t. <code>&gt;&gt;=</code>, the second that <code>return</code> is a right-identity w.r.t. <code>&gt;&gt;=</code> and the third expresses the associativity of <code>&gt;&gt;=</code>. These laws come from category theory.
</p>

<p>
My intuition for this is that a monad is a kind of wrapper around some hidden state, which gets exposed when the <code>&gt;&gt;=</code> operation is applied. To make things concrete, let's go back to the <code>Maybe</code> monad: what is important is that when we use the <code>&gt;&gt;=</code> operation, if we start with a <code>Nothing</code>, which is how we model an error, this is propagated along the chain of <code>&gt;&gt;=</code> so that an error at an early step doesn't get lost. The implementation is very simple:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span class="org-keyword">define</span> (<span class="org-function-name">&gt;&gt;=</span> m f)
  (<span class="org-keyword">match</span> m
    ((nothing) nothing)
    (('just x) (f x))))
</pre>
</div>

<p>
The function <code>&gt;&gt;=</code> takes as input a monad <code>m</code> and a function <code>f</code>: if <code>m</code> is already <code>nothing</code>, then <code>nothing</code> is returned, otherwise a <code>just</code> is built with the result of the function <code>f</code> applied on the content of the monad. This example makes very clear that the monad is passed as a "black box" to <code>&gt;==</code>, which is able to look inside and apply the function <code>f</code> before building a new monad with <code>just</code>. At this point defining <code>return</code> is straigthforward:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span class="org-keyword">define</span> (<span class="org-function-name">return</span> x) (just x))
</pre>
</div>

<p>
We have all the ingredients to evaluate safely an expression like <code>(div (val 3) (val 0))</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span class="org-keyword">define</span> (<span class="org-function-name">evaluate</span> expr) <span class="org-comment-delimiter">;; </span><span class="org-comment">returns a (just [result]) if everything goes fine, otherwise 'nothing</span>
  (<span class="org-keyword">match</span> expr
    (('val x)
     (return x))
    (('div x y)
     (&gt;== (evaluate x) (<span class="org-keyword">lambda</span> (m)
                         (&gt;== (evaluate y) (<span class="org-keyword">lambda</span> (n)
                                             (safediv m n))))))
</pre>
</div>

<p>
I know that the above code is not very readable, so let me break it down:
</p>

<ul class="org-ul">
<li><code>evaluate</code> takes as input an expression <code>expr</code>, which in our case will be a <code>(val x)</code> or a <code>(div x y)</code></li>
<li>If <code>expr</code> is a <code>(val x)</code> then we can use the <code>return</code> operation to build a <code>(just x)</code></li>
<li>Otherwise, <code>x</code> and <code>y</code> should be recursively evaluated (they can be an arbitrarily complex expression of <code>div</code> and <code>val</code>)
<ul class="org-ul">
<li><code>x</code> is evaluated, and the result (a <code>Maybe</code> monad) is passed to the next step of the computation with <code>&gt;&gt;=</code></li>
<li>This "next step" is implemented with a function that takes an argument <code>m</code> (which will be bound to the evaluation of <code>x</code>) and evaluates <code>y</code></li>
<li>The result of the evaluation of <code>y</code> is passed to the next step, which finally performs <code>safediv</code></li>
</ul></li>
</ul>

<p>
All this work translates to "evaluate <code>x</code> and store the result in <code>m</code>, evaluate <code>y</code> and store the result in <code>n</code>. Finally perform <code>safediv</code> with m and n". Notice that <code>safediv</code> takes as input integer values, while <code>evaluate</code> returns a monad: we are able to get to the integer values <code>m</code> and <code>n</code> to pass to <code>safediv</code> thanks to <code>&gt;&gt;=</code>, which performs all the wrapping/unwrapping with the monad.
</p>

<p>
Of course, this way of writing functions that use monads is not feasible in the long term, because we would end up with more and more lambdas that make it difficult to understand the code. That's why Haskell comes with the handy do-notation, that make it possible to simplify greatly the code. In Haskell, the chain of <code>&gt;&gt;=</code> applications can be expressed instead with:
</p>

<div class="org-src-container">
<pre class="src src-haskell">do m &lt;- evaluate x
   n &lt;- evaluate y
   safediv m n 
</pre>
</div>

<p>
Too bad that Scheme does not have it&#x2026; <i>Or does it?</i>
</p>

<p>
Thanks to the powerful macro system provided by Scheme, extending the language with the do-notation is a piece of cake:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span class="org-keyword">define-syntax</span> <span class="org-variable-name">do</span>
  (<span class="org-keyword">syntax-rules</span> (&lt;-)
    ((_ (var &lt;- value) rest rest* ...) <span class="org-comment-delimiter">;; </span><span class="org-comment">binding as in Haskell's do-notation</span>
     (&gt;&gt;= value (<span class="org-keyword">lambda</span> (var)
                  (<span class="org-keyword">do</span> rest rest* ...))))
    ((_ expr expr* ...) <span class="org-comment-delimiter">;; </span><span class="org-comment">base case, no bindings</span>
     (<span class="org-keyword">begin</span> expr expr* ...))))
</pre>
</div>

<p>
How does this work?
</p>

<ul class="org-ul">
<li>In the first clause, we are performing pattern matching to check if the programmer provided a binding in a similar way as it's done in Haskell
<ul class="org-ul">
<li>The binding is performed exactly how it was done in the definition of <code>evaluate</code>: <code>value</code>, which is a monad, is passed to <code>&gt;&gt;=</code> which will make the value inside the monad available. This value is bound to <code>var</code> in a lambda function</li>
<li><code>do</code> is then recursively called with the rest of the arguments that were passed to it</li>
</ul></li>
<li>In the second clause, there is no binding present, so the expression is simply returned as-is</li>
</ul>

<p>
If you have never seen Scheme (or any Lisp) in action, this might be a bit weird: <code>do</code> <b>is function that takes code as input and returns code as output, letting us to define a new syntax for the programming language</b>.
</p>

<p>
At this point, <code>evaluate</code> can be defined as:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span class="org-keyword">define</span> (<span class="org-function-name">evaluate</span> expr)
  (<span class="org-keyword">match</span> expr
    (('val x)
     (return x))
    (('div x y)
     (<span class="org-keyword">do</span> (m &lt;- (evaluate x))
         (n &lt;- (evaluate y))
       (safediv m n)))))
</pre>
</div>


<p>
Hope you found this interesting!
</p>
</div>
</body>
</html>
